Table of Contents
 Class CoordSystemByZup
Namespace
IdeaRS.OpenModel.Geometry3D
Assembly
IdeaRS.OpenModel.dll
Coordinates system based on local Z axis up In case local X is vertical then Y local axis follows Y global axis.
[OpenModelClass("CI.Geometry3D.CoordSystemByZup,CI.Geometry3D")]
public class CoordSystemByZup : CoordSystem
Inheritance
object
OpenObject
CoordSystem
CoordSystemByZup
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
 Edit this page